# How to apply Lambda transformation in pandas ```DataFrame```?

Lets perform the column data operation in pandas ```Dataframe``` through implementation of ```apply()``` and ```lambda``` functionality.

In [1]:
import pandas as pd
import numpy as np

####  Load data

In [2]:
titanic = pd.read_csv('data/titanic.csv')
df1 = titanic.set_index('Name')
df1.head(2)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C

#### Implementation of ```Apply ()``` with ```lambda()``` function

Apply ```lambda``` functionality to ```age``` column.

In [3]:
df1['remaining-age'] = df1['Age'].apply(lambda x: 100-x).head(5)
df1.head(5)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,remaining-age
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,78.0
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,62.0
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,74.0
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S,65.0
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,65.0

#### Apply ```lambda``` functionality to ```Fare``` column to transform it to new value.

In [4]:
df1['Fare'].apply(lambda x: (10*x**2 + 2*x +4)/10).head(5)

Name
Braund, Mr. Owen Harris                                  54.412500
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    5095.965519
Heikkinen, Miss. Laina                                   64.790625
Futrelle, Mrs. Jacques Heath (Lily May Peel)           2830.630000
Allen, Mr. William Henry                                 66.812500
Name: Fare, dtype: float64

Let us write a new function to supply inside the ```apply()``` function.

In [5]:
def newfeature(x):
    return 10 + x/3 + x**2

In [6]:
df1['Fare'].apply(newfeature).head(4)

Name
Braund, Mr. Owen Harris                                  64.979167
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    5115.069959
Heikkinen, Miss. Laina                                   75.447292
Futrelle, Mrs. Jacques Heath (Lily May Peel)           2847.310000
Name: Fare, dtype: float64

#### Column Operation with Lambda function

Lets create a new random dataframe to play around.

In [7]:
dates = pd.date_range('1/1/2000', periods=100)
df = pd.DataFrame(np.random.randn(100, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])
df.head()

                   A         B         C         D
2000-01-01 -1.581280 -0.513730  0.222981  1.215290
2000-01-02  0.235809 -0.952564 -0.168811 -0.654176
2000-01-03 -2.220619 -1.660355 -0.978917  0.522396
2000-01-04 -0.133000 -0.895200  0.074567  1.082764
2000-01-05  0.017172 -0.860131 -1.249578 -2.352721

We can directly add, multiply, substract etc among columns if they have same data types.

In [8]:
df['E'] = (df['A'] + df['B'])/df['C']
df.head()

                   A         B         C         D          E
2000-01-01 -1.581280 -0.513730  0.222981  1.215290  -9.395444
2000-01-02  0.235809 -0.952564 -0.168811 -0.654176   4.245905
2000-01-03 -2.220619 -1.660355 -0.978917  0.522396   3.964557
2000-01-04 -0.133000 -0.895200  0.074567  1.082764 -13.789006
2000-01-05  0.017172 -0.860131 -1.249578 -2.352721   0.674595

One can use ```lambda``` functions to transform the columns before the column operation.

In [9]:
df['F'] = df['A'].apply(lambda x : 10+x) + df['E'].apply(lambda x: x+20 if x>0 else x)
df.head()

                   A         B         C         D          E          F
2000-01-01 -1.581280 -0.513730  0.222981  1.215290  -9.395444  -0.976724
2000-01-02  0.235809 -0.952564 -0.168811 -0.654176   4.245905  34.481715
2000-01-03 -2.220619 -1.660355 -0.978917  0.522396   3.964557  31.743939
2000-01-04 -0.133000 -0.895200  0.074567  1.082764 -13.789006  -3.922006
2000-01-05  0.017172 -0.860131 -1.249578 -2.352721   0.674595  30.691767

### References:
1. [Pydata document for Pandas](https://pandas.pydata.org/docs/user_guide/index.html#user-guide)